rails/app/controllers/attempt_controller.rb

INSERT INTO "attempts" ("created_at", "exercise_id", "reps1", "reps2", "reps3", "updated_at", "user_id", "weight") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		attempt = Attempt.new(
								user_id: params[:user_id],
			          exercise_id: params[:id],
			          weight: params[:weight],
			          reps1: params[:reps1],
			          reps2: params[:reps2],
			          reps3: params[:reps3])
		if attempt
			attempt.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "attempts".* FROM "attempts" WHERE "attempts"."user_id" = $1 AND "attempts"."exercise_id" = 1 ORDER BY "attempts"."id" DESC LIMIT 1  [["user_id", 2]]
---
	def last
		password = params[:password]
		user = User.find(params[:user_id])
		# last_attempt = user.exercises.find(params[:exercise_id]).attempts.last
		last_attempt = user.attempts.where(exercise_id: params[:exercise_id]).last