rails/app/controllers/exercise_controller.rb

SELECT "exercises".* FROM "exercises"
---
	def index
		@exercises = Exercise.all

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT 1  [["id", "lowerbody"]]
---
	def show
		@exercise = Exercise.find(params[:id])