rails/app/controllers/user_controller.rb

	def create
		p params[:email]
		user = User.find_by_email(params[:email])
		if user
			result = {message: "failed"}
			render json: result
		else
			user = User.create!(first_name: params[:first_name],
										last_name: params[:last_name],
										email: params[:email],
										password: params[:password],
										password_confirmation: params[:password_confirmation]
											 )
---
INSERT INTO "users" ("email", "first_name", "last_name", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "lee@gmail.com"], ["first_name", "Lee"], ["last_name", "S"], ["password_digest", "$2a$10$g9JNuc/OTOJKc4DKUaWAUOUIqkEbx/Fs4ZoLsmBYSm6g8BW8bq6g."]]