rails/app/controllers/workout_controller.rb

SELECT "workouts".* FROM "workouts"
SELECT "workouts"."id", "workouts"."name" FROM "workouts"
---
	def index
		workouts = Workout.all
		response = workouts.pluck(:id,:name)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def show
		workout = Workout.find(params[:id])

SELECT "exercises".* FROM "exercises" WHERE "exercises"."workout_id" = 2
---
	def show_exercise
		exercises = Exercise.where(workout_id: params[:workout_id])